Ran Plan for project: `development` dir: `terraform/infra/envs/dev` workspace: `default`

<details><summary>Show Output</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+ create
~ update in-place
 <= read (data resources)

Terraform will perform the following actions:

  # module.app_key_vaul_secrets.azurerm_key_vault_secret.this["appinsights_connection_string"] will be created
+ resource "azurerm_key_vault_secret" "this" {
      + id                      = (known after apply)
      + key_vault_id            = (known after apply)
      + name                    = "APPINSIGHTS-CONNECTION-STRING"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # module.app_key_vaul_secrets.azurerm_key_vault_secret.this["db_host"] will be created
+ resource "azurerm_key_vault_secret" "this" {
      + id                      = (known after apply)
      + key_vault_id            = (known after apply)
      + name                    = "DB-HOST"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # module.app_key_vaul_secrets.azurerm_key_vault_secret.this["db_name"] will be created
+ resource "azurerm_key_vault_secret" "this" {
      + id                      = (known after apply)
      + key_vault_id            = (known after apply)
      + name                    = "DB-NAME"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # module.app_key_vaul_secrets.azurerm_key_vault_secret.this["db_password"] will be created
+ resource "azurerm_key_vault_secret" "this" {
      + id                      = (known after apply)
      + key_vault_id            = (known after apply)
      + name                    = "DB-PASSWORD"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # module.app_key_vaul_secrets.azurerm_key_vault_secret.this["db_port"] will be created
+ resource "azurerm_key_vault_secret" "this" {
      + id                      = (known after apply)
      + key_vault_id            = (known after apply)
      + name                    = "DB-PORT"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # module.app_key_vaul_secrets.azurerm_key_vault_secret.this["db_username"] will be created
+ resource "azurerm_key_vault_secret" "this" {
      + id                      = (known after apply)
      + key_vault_id            = (known after apply)
      + name                    = "DB-USERNAME"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # module.app_key_vaul_secrets.azurerm_key_vault_secret.this["default_from_email"] will be created
+ resource "azurerm_key_vault_secret" "this" {
      + id                      = (known after apply)
      + key_vault_id            = (known after apply)
      + name                    = "DEFAULT-FROM-EMAIL"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # module.app_key_vaul_secrets.azurerm_key_vault_secret.this["django_secret_key"] will be created
+ resource "azurerm_key_vault_secret" "this" {
      + id                      = (known after apply)
      + key_vault_id            = (known after apply)
      + name                    = "DJANGO-SECRET-KEY"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # module.app_key_vaul_secrets.azurerm_key_vault_secret.this["redis_host"] will be created
+ resource "azurerm_key_vault_secret" "this" {
      + id                      = (known after apply)
      + key_vault_id            = (known after apply)
      + name                    = "REDIS-HOST"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # module.app_key_vaul_secrets.azurerm_key_vault_secret.this["redis_key"] will be created
+ resource "azurerm_key_vault_secret" "this" {
      + id                      = (known after apply)
      + key_vault_id            = (known after apply)
      + name                    = "REDIS-KEY"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # module.app_key_vaul_secrets.azurerm_key_vault_secret.this["redis_port"] will be created
+ resource "azurerm_key_vault_secret" "this" {
      + id                      = (known after apply)
      + key_vault_id            = (known after apply)
      + name                    = "REDIS-PORT"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # module.app_key_vaul_secrets.azurerm_key_vault_secret.this["sendgrid_api_key"] will be created
+ resource "azurerm_key_vault_secret" "this" {
      + id                      = (known after apply)
      + key_vault_id            = (known after apply)
      + name                    = "SENDGRID-API-KEY"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # module.app_key_vaul_secrets.azurerm_key_vault_secret.this["webappcontainer_client_id"] will be created
+ resource "azurerm_key_vault_secret" "this" {
      + id                      = (known after apply)
      + key_vault_id            = (known after apply)
      + name                    = "WEBAPPCONTAINER-CLIENT-ID"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # module.app_service.azurerm_app_service_custom_hostname_binding.this["app"] will be created
+ resource "azurerm_app_service_custom_hostname_binding" "this" {
      + app_service_name    = "azphoto-dev-app"
      + hostname            = "www.azphoto.xyz"
      + id                  = (known after apply)
      + resource_group_name = "azphoto-dev-rg"
      + ssl_state           = (known after apply)
      + thumbprint          = (known after apply)
      + virtual_ip          = (known after apply)
    }

  # module.app_service.azurerm_dns_txt_record.web_app_validation["app"] will be created
+ resource "azurerm_dns_txt_record" "web_app_validation" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "asuid.www"
      + resource_group_name = "azphoto-dev-rg"
      + ttl                 = 3600
      + zone_name           = "azphoto.xyz"

      + record {
          # At least one attribute in this block is (or was) sensitive,
          # so its contents will not be displayed.
        }
    }

  # module.app_service.azurerm_linux_web_app.this["app"] will be created
+ resource "azurerm_linux_web_app" "this" {
      + app_settings                      = {
          + "APPINSIGHTS_CONNECTION_STRING"       = "@Microsoft.KeyVault(VaultName=azphoto-dev-app-vault;SecretName=APPINSIGHTS-CONNECTION-STRING)"
          + "AZURE_CLIENT_ID"                     = "@Microsoft.KeyVault(VaultName=azphoto-dev-app-vault;SecretName=WEBAPPCONTAINER-CLIENT-ID)"
          + "DB_HOST"                             = "@Microsoft.KeyVault(VaultName=azphoto-dev-app-vault;SecretName=DB-HOST)"
          + "DB_NAME"                             = "@Microsoft.KeyVault(VaultName=azphoto-dev-app-vault;SecretName=DB-NAME)"
          + "DB_PASSWORD"                         = "@Microsoft.KeyVault(VaultName=azphoto-dev-app-vault;SecretName=DB-PASSWORD)"
          + "DB_PORT"                             = "@Microsoft.KeyVault(VaultName=azphoto-dev-app-vault;SecretName=DB-PORT)"
          + "DB_USERNAME"                         = "@Microsoft.KeyVault(VaultName=azphoto-dev-app-vault;SecretName=DB-USERNAME)"
          + "DJANGO_ALLOWED_HOSTS"                = "www.azphoto.xyz"
          + "DJANGO_AZURE_ACCOUNT_NAME"           = "azphotodevapp74889"
          + "DJANGO_AZURE_MEDIA_CONTAINER"        = "media"
          + "DJANGO_AZURE_STATIC_CONTAINER"       = "static"
          + "DJANGO_DEBUG"                        = "False"
          + "DJANGO_DEFAULT_FROM_EMAIL"           = "@Microsoft.KeyVault(VaultName=azphoto-dev-app-vault;SecretName=DEFAULT-FROM-EMAIL)"
          + "DJANGO_SECRET_KEY"                   = "@Microsoft.KeyVault(VaultName=azphoto-dev-app-vault;SecretName=DJANGO-SECRET-KEY)"
          + "DJANGO_SECURE_SSL_REDIRECT"          = "False"
          + "DJANGO_SETTINGS_MODULE"              = "config.settings.production"
          + "REDIS_HOST"                          = "@Microsoft.KeyVault(VaultName=azphoto-dev-app-vault;SecretName=REDIS-HOST)"
          + "REDIS_KEY"                           = "@Microsoft.KeyVault(VaultName=azphoto-dev-app-vault;SecretName=REDIS-KEY)"
          + "REDIS_PORT"                          = "@Microsoft.KeyVault(VaultName=azphoto-dev-app-vault;SecretName=REDIS-PORT)"
          + "SENDGRID_API_KEY"                    = "@Microsoft.KeyVault(VaultName=azphoto-dev-app-vault;SecretName=SENDGRID-API-KEY)"
          + "WEBSITES_ENABLE_APP_SERVICE_STORAGE" = "False"
          + "WEBSITES_PORT"                       = "8000"
        }
      + client_affinity_enabled           = false
      + client_certificate_enabled        = false
      + client_certificate_mode           = "Required"
      + custom_domain_verification_id     = (sensitive value)
      + default_hostname                  = (known after apply)
      + enabled                           = true
      + hosting_environment_id            = (known after apply)
      + https_only                        = true
      + id                                = (known after apply)
      + key_vault_reference_identity_id   = (known after apply)
      + kind                              = (known after apply)
      + location                          = "japaneast"
      + name                              = "azphoto-dev-app"
      + outbound_ip_address_list          = (known after apply)
      + outbound_ip_addresses             = (known after apply)
      + possible_outbound_ip_address_list = (known after apply)
      + possible_outbound_ip_addresses    = (known after apply)
      + public_network_access_enabled     = true
      + resource_group_name               = "azphoto-dev-rg"
      + service_plan_id                   = (known after apply)
      + site_credential                   = (sensitive value)
      + virtual_network_subnet_id         = "/subscriptions/14eac771-6a7b-423a-b6ca-d35eca40ba36/resourceGroups/azphoto-dev-rg/providers/Microsoft.Network/virtualNetworks/azphoto-dev-spoke1-vnet/subnets/app-subnet"
      + zip_deploy_file                   = (known after apply)

      + identity {
          + identity_ids = (known after apply)
          + principal_id = (known after apply)
          + tenant_id    = (known after apply)
          + type         = "UserAssigned"
        }

      + site_config {
          + always_on                                     = false
          + container_registry_managed_identity_client_id = (known after apply)
          + container_registry_use_managed_identity       = true
          + default_documents                             = (known after apply)
          + detailed_error_logging_enabled                = (known after apply)
          + ftps_state                                    = "Disabled"
          + health_check_eviction_time_in_min             = (known after apply)
          + http2_enabled                                 = false
          + linux_fx_version                              = (known after apply)
          + load_balancing_mode                           = "LeastRequests"
          + local_mysql_enabled                           = false
          + managed_pipeline_mode                         = "Integrated"
          + minimum_tls_version                           = "1.2"
          + remote_debugging_enabled                      = false
          + remote_debugging_version                      = (known after apply)
          + scm_minimum_tls_version                       = "1.2"
          + scm_type                                      = (known after apply)
          + scm_use_main_ip_restriction                   = false
          + use_32_bit_worker                             = true
          + vnet_route_all_enabled                        = true
          + websockets_enabled                            = false
          + worker_count                                  = (known after apply)

          + application_stack {
              + docker_image_name        = "appsvc/staticsite:latest"
              + docker_registry_password = (sensitive value)
              + docker_registry_url      = "https://mcr.microsoft.com"
              + docker_registry_username = (known after apply)
            }

          + ip_restriction {
              + action      = "Allow"
              + headers     = [
                  + {
                      + x_azure_fdid      = (known after apply)
                      + x_fd_health_probe = []
                      + x_forwarded_for   = []
                      + x_forwarded_host  = []
                    },
                ]
              + name        = "AllowFrontDoor"
              + priority    = 100
              + service_tag = "AzureFrontDoor.Backend"
            }
          + ip_restriction {
              + action     = "Allow"
              + ip_address = "217.178.97.227,113.39.66.10"
              + name       = "AllowMyIP"
              + priority   = 200
            }

          + scm_ip_restriction {
              + action      = "Allow"
              + name        = "AllowDevOps"
              + priority    = 100
              + service_tag = "AzureCloud"
            }
          + scm_ip_restriction {
              + action     = "Allow"
              + ip_address = "217.178.97.227,113.39.66.10"
              + name       = "AllowMyIP"
              + priority   = 200
            }
        }
    }

  # module.app_service.azurerm_service_plan.this["app"] will be created
+ resource "azurerm_service_plan" "this" {
      + id                           = (known after apply)
      + kind                         = (known after apply)
      + location                     = "japaneast"
      + maximum_elastic_worker_count = (known after apply)
      + name                         = "azphoto-dev-app-plan"
      + os_type                      = "Linux"
      + per_site_scaling_enabled     = false
      + reserved                     = (known after apply)
      + resource_group_name          = "azphoto-dev-rg"
      + sku_name                     = "B1"
      + worker_count                 = (known after apply)
    }

  # module.application_insights.azurerm_application_insights.this["app"] will be created
+ resource "azurerm_application_insights" "this" {
      + app_id                                = (known after apply)
      + application_type                      = "web"
      + connection_string                     = (sensitive value)
      + daily_data_cap_in_gb                  = (known after apply)
      + daily_data_cap_notifications_disabled = (known after apply)
      + disable_ip_masking                    = false
      + force_customer_storage_for_profiler   = false
      + id                                    = (known after apply)
      + instrumentation_key                   = (sensitive value)
      + internet_ingestion_enabled            = true
      + internet_query_enabled                = true
      + local_authentication_disabled         = false
      + location                              = "japaneast"
      + name                                  = "azphoto-dev-app-appinsights"
      + resource_group_name                   = "azphoto-dev-rg"
      + retention_in_days                     = 90
      + sampling_percentage                   = 100
      + workspace_id                          = (known after apply)
    }

  # module.container_registry.azurerm_container_registry.this["app"] will be created
+ resource "azurerm_container_registry" "this" {
      + admin_enabled                 = false
      + admin_password                = (sensitive value)
      + admin_username                = (known after apply)
      + encryption                    = (known after apply)
      + export_policy_enabled         = true
      + id                            = (known after apply)
      + location                      = "japaneast"
      + login_server                  = (known after apply)
      + name                          = "azphotodevacr"
      + network_rule_bypass_option    = "AzureServices"
      + network_rule_set              = (known after apply)
      + public_network_access_enabled = true
      + resource_group_name           = "azphoto-dev-rg"
      + retention_policy              = (known after apply)
      + sku                           = "Basic"
      + trust_policy                  = (known after apply)
      + zone_redundancy_enabled       = false
    }

  # module.diagnostic_setting.data.azurerm_monitor_diagnostic_categories.this["app_service_app"] will be read during apply
  # (config refers to values not yet known)
 <= data "azurerm_monitor_diagnostic_categories" "this" {
      + id                  = (known after apply)
      + log_category_groups = (known after apply)
      + log_category_types  = (known after apply)
      + logs                = (known after apply)
      + metrics             = (known after apply)
      + resource_id         = (known after apply)
    }

  # module.diagnostic_setting.data.azurerm_monitor_diagnostic_categories.this["blob_app"] will be read during apply
  # (config refers to values not yet known)
 <= data "azurerm_monitor_diagnostic_categories" "this" {
      + id                  = (known after apply)
      + log_category_groups = (known after apply)
      + log_category_types  = (known after apply)
      + logs                = (known after apply)
      + metrics             = (known after apply)
      + resource_id         = (known after apply)
    }

  # module.diagnostic_setting.data.azurerm_monitor_diagnostic_categories.this["blob_log"] will be read during apply
  # (config refers to values not yet known)
 <= data "azurerm_monitor_diagnostic_categories" "this" {
      + id                  = (known after apply)
      + log_category_groups = (known after apply)
      + log_category_types  = (known after apply)
      + logs                = (known after apply)
      + metrics             = (known after apply)
      + resource_id         = (known after apply)
    }

  # module.diagnostic_setting.data.azurerm_monitor_diagnostic_categories.this["container_registry_app"] will be read during apply
  # (config refers to values not yet known)
 <= data "azurerm_monitor_diagnostic_categories" "this" {
      + id                  = (known after apply)
      + log_category_groups = (known after apply)
      + log_category_types  = (known after apply)
      + logs                = (known after apply)
      + metrics             = (known after apply)
      + resource_id         = (known after apply)
    }

  # module.diagnostic_setting.data.azurerm_monitor_diagnostic_categories.this["frontdoor_app"] will be read during apply
  # (config refers to values not yet known)
 <= data "azurerm_monitor_diagnostic_categories" "this" {
      + id                  = (known after apply)
      + log_category_groups = (known after apply)
      + log_category_types  = (known after apply)
      + logs                = (known after apply)
      + metrics             = (known after apply)
      + resource_id         = (known after apply)
    }

  # module.diagnostic_setting.data.azurerm_monitor_diagnostic_categories.this["key_vault_app"] will be read during apply
  # (config refers to values not yet known)
 <= data "azurerm_monitor_diagnostic_categories" "this" {
      + id                  = (known after apply)
      + log_category_groups = (known after apply)
      + log_category_types  = (known after apply)
      + logs                = (known after apply)
      + metrics             = (known after apply)
      + resource_id         = (known after apply)
    }

  # module.diagnostic_setting.data.azurerm_monitor_diagnostic_categories.this["mysql_app"] will be read during apply
  # (config refers to values not yet known)
 <= data "azurerm_monitor_diagnostic_categories" "this" {
      + id                  = (known after apply)
      + log_category_groups = (known after apply)
      + log_category_types  = (known after apply)
      + logs                = (known after apply)
      + metrics             = (known after apply)
      + resource_id         = (known after apply)
    }

  # module.diagnostic_setting.data.azurerm_monitor_diagnostic_categories.this["redis_app"] will be read during apply
  # (config refers to values not yet known)
 <= data "azurerm_monitor_diagnostic_categories" "this" {
      + id                  = (known after apply)
      + log_category_groups = (known after apply)
      + log_category_types  = (known after apply)
      + logs                = (known after apply)
      + metrics             = (known after apply)
      + resource_id         = (known after apply)
    }

  # module.diagnostic_setting.data.azurerm_monitor_diagnostic_categories.this["storage_account_app"] will be read during apply
  # (config refers to values not yet known)
 <= data "azurerm_monitor_diagnostic_categories" "this" {
      + id                  = (known after apply)
      + log_category_groups = (known after apply)
      + log_category_types  = (known after apply)
      + logs                = (known after apply)
      + metrics             = (known after apply)
      + resource_id         = (known after apply)
    }

  # module.diagnostic_setting.data.azurerm_monitor_diagnostic_categories.this["storage_account_log"] will be read during apply
  # (config refers to values not yet known)
 <= data "azurerm_monitor_diagnostic_categories" "this" {
      + id                  = (known after apply)
      + log_category_groups = (known after apply)
      + log_category_types  = (known after apply)
      + logs                = (known after apply)
      + metrics             = (known after apply)
      + resource_id         = (known after apply)
    }

  # module.diagnostic_setting.azurerm_monitor_diagnostic_setting.this["app_service_app"] will be created
+ resource "azurerm_monitor_diagnostic_setting" "this" {
      + id                             = (known after apply)
      + log_analytics_destination_type = (known after apply)
      + log_analytics_workspace_id     = (known after apply)
      + name                           = "azphoto-dev-app-service-app-diag-setting"
      + target_resource_id             = (known after apply)
    }

  # module.diagnostic_setting.azurerm_monitor_diagnostic_setting.this["blob_app"] will be created
+ resource "azurerm_monitor_diagnostic_setting" "this" {
      + id                             = (known after apply)
      + log_analytics_destination_type = (known after apply)
      + log_analytics_workspace_id     = (known after apply)
      + name                           = "azphoto-dev-blob-app-diag-setting"
      + target_resource_id             = (known after apply)
    }

  # module.diagnostic_setting.azurerm_monitor_diagnostic_setting.this["blob_log"] will be created
+ resource "azurerm_monitor_diagnostic_setting" "this" {
      + id                             = (known after apply)
      + log_analytics_destination_type = (known after apply)
      + log_analytics_workspace_id     = (known after apply)
      + name                           = "azphoto-dev-blob-log-diag-setting"
      + target_resource_id             = (known after apply)
    }

  # module.diagnostic_setting.azurerm_monitor_diagnostic_setting.this["container_registry_app"] will be created
+ resource "azurerm_monitor_diagnostic_setting" "this" {
      + id                             = (known after apply)
      + log_analytics_destination_type = (known after apply)
      + log_analytics_workspace_id     = (known after apply)
      + name                           = "azphoto-dev-container-registry-app-diag-setting"
      + target_resource_id             = (known after apply)
    }

  # module.diagnostic_setting.azurerm_monitor_diagnostic_setting.this["frontdoor_app"] will be created
+ resource "azurerm_monitor_diagnostic_setting" "this" {
      + id                             = (known after apply)
      + log_analytics_destination_type = (known after apply)
      + log_analytics_workspace_id     = (known after apply)
      + name                           = "azphoto-dev-frontdoor-app-diag-setting"
      + target_resource_id             = (known after apply)
    }

  # module.diagnostic_setting.azurerm_monitor_diagnostic_setting.this["key_vault_app"] will be created
+ resource "azurerm_monitor_diagnostic_setting" "this" {
      + id                             = (known after apply)
      + log_analytics_destination_type = (known after apply)
      + log_analytics_workspace_id     = (known after apply)
      + name                           = "azphoto-dev-key-vault-app-diag-setting"
      + target_resource_id             = (known after apply)
    }

  # module.diagnostic_setting.azurerm_monitor_diagnostic_setting.this["mysql_app"] will be created
+ resource "azurerm_monitor_diagnostic_setting" "this" {
      + id                             = (known after apply)
      + log_analytics_destination_type = (known after apply)
      + log_analytics_workspace_id     = (known after apply)
      + name                           = "azphoto-dev-mysql-app-diag-setting"
      + target_resource_id             = (known after apply)
    }

  # module.diagnostic_setting.azurerm_monitor_diagnostic_setting.this["redis_app"] will be created
+ resource "azurerm_monitor_diagnostic_setting" "this" {
      + id                             = (known after apply)
      + log_analytics_destination_type = (known after apply)
      + log_analytics_workspace_id     = (known after apply)
      + name                           = "azphoto-dev-redis-app-diag-setting"
      + target_resource_id             = (known after apply)
    }

  # module.diagnostic_setting.azurerm_monitor_diagnostic_setting.this["storage_account_app"] will be created
+ resource "azurerm_monitor_diagnostic_setting" "this" {
      + id                             = (known after apply)
      + log_analytics_destination_type = (known after apply)
      + log_analytics_workspace_id     = (known after apply)
      + name                           = "azphoto-dev-storage-account-app-diag-setting"
      + target_resource_id             = (known after apply)
    }

  # module.diagnostic_setting.azurerm_monitor_diagnostic_setting.this["storage_account_log"] will be created
+ resource "azurerm_monitor_diagnostic_setting" "this" {
      + id                             = (known after apply)
      + log_analytics_destination_type = (known after apply)
      + log_analytics_workspace_id     = (known after apply)
      + name                           = "azphoto-dev-storage-account-log-diag-setting"
      + target_resource_id             = (known after apply)
    }

  # module.dns.azurerm_dns_zone.this["app"] will be created
+ resource "azurerm_dns_zone" "this" {
      + id                        = (known after apply)
      + max_number_of_record_sets = (known after apply)
      + name                      = "azphoto.xyz"
      + name_servers              = (known after apply)
      + number_of_record_sets     = (known after apply)
      + resource_group_name       = "azphoto-dev-rg"
    }

  # module.frontdoor.azurerm_cdn_frontdoor_custom_domain.this["app"] will be created
+ resource "azurerm_cdn_frontdoor_custom_domain" "this" {
      + cdn_frontdoor_profile_id = (known after apply)
      + dns_zone_id              = (known after apply)
      + expiration_date          = (known after apply)
      + host_name                = "www.azphoto.xyz"
      + id                       = (known after apply)
      + name                     = "www-azphoto-xyz"
      + validation_token         = (known after apply)

      + tls {
          + cdn_frontdoor_secret_id = (known after apply)
          + certificate_type        = "ManagedCertificate"
          + minimum_tls_version     = "TLS12"
        }
    }

  # module.frontdoor.azurerm_cdn_frontdoor_custom_domain_association.this["app"] will be created
+ resource "azurerm_cdn_frontdoor_custom_domain_association" "this" {
      + cdn_frontdoor_custom_domain_id = (known after apply)
      + cdn_frontdoor_route_ids        = (known after apply)
      + id                             = (known after apply)
    }

  # module.frontdoor.azurerm_cdn_frontdoor_endpoint.this["app"] will be created
+ resource "azurerm_cdn_frontdoor_endpoint" "this" {
      + cdn_frontdoor_profile_id = (known after apply)
      + enabled                  = true
      + host_name                = (known after apply)
      + id                       = (known after apply)
      + name                     = "azphoto-dev-afd-app-ep"
    }

  # module.frontdoor.azurerm_cdn_frontdoor_firewall_policy.this["app"] will be created
+ resource "azurerm_cdn_frontdoor_firewall_policy" "this" {
      + custom_block_response_status_code = 403
      + enabled                           = true
      + frontend_endpoint_ids             = (known after apply)
      + id                                = (known after apply)
      + mode                              = "Prevention"
      + name                              = "IPRestrictionPolicy"
      + resource_group_name               = "azphoto-dev-rg"
      + sku_name                          = "Standard_AzureFrontDoor"

      + custom_rule {
          + action                         = "Block"
          + enabled                        = true
          + name                           = "AllowClientIP"
          + priority                       = 100
          + rate_limit_duration_in_minutes = 1
          + rate_limit_threshold           = 10
          + type                           = "MatchRule"

          + match_condition {
              + match_values       = [
                  + "217.178.97.227",
                  + "113.39.66.10",
                ]
              + match_variable     = "RemoteAddr"
              + negation_condition = true
              + operator           = "IPMatch"
            }
        }
    }

  # module.frontdoor.azurerm_cdn_frontdoor_origin.this["app"] will be created
+ resource "azurerm_cdn_frontdoor_origin" "this" {
      + cdn_frontdoor_origin_group_id  = (known after apply)
      + certificate_name_check_enabled = true
      + enabled                        = true
      + health_probes_enabled          = (known after apply)
      + host_name                      = (known after apply)
      + http_port                      = 80
      + https_port                     = 443
      + id                             = (known after apply)
      + name                           = "azphoto-dev-afd-app-origin"
      + origin_host_header             = "www.azphoto.xyz"
      + priority                       = 1
      + weight                         = 1000
    }

  # module.frontdoor.azurerm_cdn_frontdoor_origin.this["blob"] will be created
+ resource "azurerm_cdn_frontdoor_origin" "this" {
      + cdn_frontdoor_origin_group_id  = (known after apply)
      + certificate_name_check_enabled = true
      + enabled                        = true
      + health_probes_enabled          = (known after apply)
      + host_name                      = (known after apply)
      + http_port                      = 80
      + https_port                     = 443
      + id                             = (known after apply)
      + name                           = "azphoto-dev-afd-blob-origin"
      + origin_host_header             = (known after apply)
      + priority                       = 1
      + weight                         = 1000
    }

  # module.frontdoor.azurerm_cdn_frontdoor_origin_group.this["app"] will be created
+ resource "azurerm_cdn_frontdoor_origin_group" "this" {
      + cdn_frontdoor_profile_id                                  = (known after apply)
      + id                                                        = (known after apply)
      + name                                                      = "azphoto-dev-afd-app-backend"
      + restore_traffic_time_to_healed_or_new_endpoint_in_minutes = 0
      + session_affinity_enabled                                  = false

      + health_probe {
          + interval_in_seconds = 100
          + path                = "/"
          + protocol            = "Https"
          + request_type        = "HEAD"
        }

      + load_balancing {
          + additional_latency_in_milliseconds = 50
          + sample_size                        = 4
          + successful_samples_required        = 3
        }
    }

  # module.frontdoor.azurerm_cdn_frontdoor_origin_group.this["blob"] will be created
+ resource "azurerm_cdn_frontdoor_origin_group" "this" {
      + cdn_frontdoor_profile_id                                  = (known after apply)
      + id                                                        = (known after apply)
      + name                                                      = "azphoto-dev-afd-blob-backend"
      + restore_traffic_time_to_healed_or_new_endpoint_in_minutes = 0
      + session_affinity_enabled                                  = false

      + health_probe {
          + interval_in_seconds = 100
          + path                = "/"
          + protocol            = "Https"
          + request_type        = "HEAD"
        }

      + load_balancing {
          + additional_latency_in_milliseconds = 50
          + sample_size                        = 4
          + successful_samples_required        = 3
        }
    }

  # module.frontdoor.azurerm_cdn_frontdoor_profile.this["app"] will be created
+ resource "azurerm_cdn_frontdoor_profile" "this" {
      + id                       = (known after apply)
      + name                     = "azphoto-dev-afd"
      + resource_group_name      = "azphoto-dev-rg"
      + resource_guid            = (known after apply)
      + response_timeout_seconds = 60
      + sku_name                 = "Standard_AzureFrontDoor"
    }

  # module.frontdoor.azurerm_cdn_frontdoor_route.this["app"] will be created
+ resource "azurerm_cdn_frontdoor_route" "this" {
      + cdn_frontdoor_custom_domain_ids = (known after apply)
      + cdn_frontdoor_endpoint_id       = (known after apply)
      + cdn_frontdoor_origin_group_id   = (known after apply)
      + cdn_frontdoor_origin_ids        = (known after apply)
      + enabled                         = true
      + forwarding_protocol             = "HttpsOnly"
      + https_redirect_enabled          = true
      + id                              = (known after apply)
      + link_to_default_domain          = true
      + name                            = "azphoto-dev-afd-app-route"
      + patterns_to_match               = [
          + "/*",
        ]
      + supported_protocols             = [
          + "Http",
          + "Https",
        ]
    }

  # module.frontdoor.azurerm_cdn_frontdoor_route.this["blob"] will be created
+ resource "azurerm_cdn_frontdoor_route" "this" {
      + cdn_frontdoor_custom_domain_ids = (known after apply)
      + cdn_frontdoor_endpoint_id       = (known after apply)
      + cdn_frontdoor_origin_group_id   = (known after apply)
      + cdn_frontdoor_origin_ids        = (known after apply)
      + enabled                         = true
      + forwarding_protocol             = "HttpsOnly"
      + https_redirect_enabled          = true
      + id                              = (known after apply)
      + link_to_default_domain          = true
      + name                            = "azphoto-dev-afd-blob-route"
      + patterns_to_match               = [
          + "/media/*",
          + "/static/*",
        ]
      + supported_protocols             = [
          + "Http",
          + "Https",
        ]

      + cache {
          + compression_enabled           = true
          + content_types_to_compress     = [
              + "text/html",
              + "text/css",
              + "text/javascript",
            ]
          + query_string_caching_behavior = "IgnoreQueryString"
          + query_strings                 = []
        }
    }

  # module.frontdoor.azurerm_cdn_frontdoor_security_policy.this["app"] will be created
+ resource "azurerm_cdn_frontdoor_security_policy" "this" {
      + cdn_frontdoor_profile_id = (known after apply)
      + id                       = (known after apply)
      + name                     = "azphoto-dev-afd-app-secpolicy"

      + security_policies {
          + firewall {
              + cdn_frontdoor_firewall_policy_id = (known after apply)

              + association {
                  + patterns_to_match = [
                      + "/*",
                    ]

                  + domain {
                      + active                  = (known after apply)
                      + cdn_frontdoor_domain_id = (known after apply)
                    }
                }
            }
        }
    }

  # module.frontdoor.azurerm_dns_cname_record.afd_cname["app"] will be created
+ resource "azurerm_dns_cname_record" "afd_cname" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "www"
      + record              = (known after apply)
      + resource_group_name = "azphoto-dev-rg"
      + ttl                 = 3600
      + zone_name           = "azphoto.xyz"
    }

  # module.frontdoor.azurerm_dns_txt_record.afd_validation["app"] will be created
+ resource "azurerm_dns_txt_record" "afd_validation" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "_dnsauth.www"
      + resource_group_name = "azphoto-dev-rg"
      + ttl                 = 3600
      + zone_name           = "azphoto.xyz"

      + record {
          + value = (known after apply)
        }
    }

  # module.key_vault.azurerm_key_vault.this["app"] will be created
+ resource "azurerm_key_vault" "this" {
      + access_policy                 = []
      + enable_rbac_authorization     = true
      + id                            = (known after apply)
      + location                      = "japaneast"
      + name                          = "azphoto-dev-app-vault"
      + public_network_access_enabled = true
      + purge_protection_enabled      = false
      + resource_group_name           = "azphoto-dev-rg"
      + sku_name                      = "standard"
      + soft_delete_retention_days    = 7
      + tenant_id                     = "7be8e2c6-3f1e-47d6-a7e3-b4c7f5f69071"
      + vault_uri                     = (known after apply)

      + network_acls {
          + bypass         = "AzureServices"
          + default_action = "Deny"
          + ip_rules       = [
              + "113.39.66.10",
              + "217.178.97.227",
              + "52.140.232.52",
            ]
        }
    }

  # module.log_analytics.azurerm_log_analytics_workspace.this["logs"] will be created
+ resource "azurerm_log_analytics_workspace" "this" {
      + allow_resource_only_permissions    = true
      + daily_quota_gb                     = -1
      + id                                 = (known after apply)
      + internet_ingestion_enabled         = true
      + internet_query_enabled             = true
      + local_authentication_disabled      = false
      + location                           = "japaneast"
      + name                               = "azphoto-dev-logs"
      + primary_shared_key                 = (sensitive value)
      + reservation_capacity_in_gb_per_day = (known after apply)
      + resource_group_name                = "azphoto-dev-rg"
      + retention_in_days                  = 30
      + secondary_shared_key               = (sensitive value)
      + sku                                = "PerGB2018"
      + workspace_id                       = (known after apply)
    }

  # module.mysql.azurerm_mysql_flexible_database.this["app"] will be created
+ resource "azurerm_mysql_flexible_database" "this" {
      + charset             = "utf8mb4"
      + collation           = "utf8mb4_0900_ai_ci"
      + id                  = (known after apply)
      + name                = "photo"
      + resource_group_name = "azphoto-dev-rg"
      + server_name         = "azphoto-dev-mysql-74889"
    }

  # module.mysql.azurerm_mysql_flexible_server.this["app"] will be created
+ resource "azurerm_mysql_flexible_server" "this" {
      + administrator_login           = "dbadmin"
      + administrator_password        = (sensitive value)
      + backup_retention_days         = 7
      + delegated_subnet_id           = "/subscriptions/14eac771-6a7b-423a-b6ca-d35eca40ba36/resourceGroups/azphoto-dev-rg/providers/Microsoft.Network/virtualNetworks/azphoto-dev-spoke1-vnet/subnets/db-subnet"
      + fqdn                          = (known after apply)
      + geo_redundant_backup_enabled  = false
      + id                            = (known after apply)
      + location                      = "japaneast"
      + name                          = "azphoto-dev-mysql-74889"
      + private_dns_zone_id           = (known after apply)
      + public_network_access_enabled = (known after apply)
      + replica_capacity              = (known after apply)
      + replication_role              = (known after apply)
      + resource_group_name           = "azphoto-dev-rg"
      + sku_name                      = "B_Standard_B1s"
      + version                       = "8.0.21"
      + zone                          = "1"

      + storage {
          + auto_grow_enabled = true
          + iops              = 360
          + size_gb           = 20
        }
    }

  # module.mysql.azurerm_mysql_flexible_server_configuration.ssl_config["app"] will be created
+ resource "azurerm_mysql_flexible_server_configuration" "ssl_config" {
      + id                  = (known after apply)
      + name                = "require_secure_transport"
      + resource_group_name = "azphoto-dev-rg"
      + server_name         = "azphoto-dev-mysql-74889"
      + value               = "ON"
    }

  # module.mysql.azurerm_private_dns_zone.this["app"] will be created
+ resource "azurerm_private_dns_zone" "this" {
      + id                                                    = (known after apply)
      + max_number_of_record_sets                             = (known after apply)
      + max_number_of_virtual_network_links                   = (known after apply)
      + max_number_of_virtual_network_links_with_registration = (known after apply)
      + name                                                  = "azphoto-dev-mysql-74889.private.mysql.database.azure.com"
      + number_of_record_sets                                 = (known after apply)
      + resource_group_name                                   = "azphoto-dev-rg"
    }

  # module.mysql.azurerm_private_dns_zone_virtual_network_link.this["app"] will be created
+ resource "azurerm_private_dns_zone_virtual_network_link" "this" {
      + id                    = (known after apply)
      + name                  = "mysqlfsVnetZone"
      + private_dns_zone_name = "azphoto-dev-mysql-74889.private.mysql.database.azure.com"
      + registration_enabled  = false
      + resource_group_name   = "azphoto-dev-rg"
      + virtual_network_id    = "/subscriptions/14eac771-6a7b-423a-b6ca-d35eca40ba36/resourceGroups/azphoto-dev-rg/providers/Microsoft.Network/virtualNetworks/azphoto-dev-spoke1-vnet"
    }

  # module.private_dns_zone.azurerm_private_dns_zone.this["blob"] will be created
+ resource "azurerm_private_dns_zone" "this" {
      + id                                                    = (known after apply)
      + max_number_of_record_sets                             = (known after apply)
      + max_number_of_virtual_network_links                   = (known after apply)
      + max_number_of_virtual_network_links_with_registration = (known after apply)
      + name                                                  = "privatelink.blob.core.windows.net"
      + number_of_record_sets                                 = (known after apply)
      + resource_group_name                                   = "azphoto-dev-rg"
    }

  # module.private_dns_zone.azurerm_private_dns_zone.this["key_vault"] will be created
+ resource "azurerm_private_dns_zone" "this" {
      + id                                                    = (known after apply)
      + max_number_of_record_sets                             = (known after apply)
      + max_number_of_virtual_network_links                   = (known after apply)
      + max_number_of_virtual_network_links_with_registration = (known after apply)
      + name                                                  = "privatelink.vaultcore.azure.net"
      + number_of_record_sets                                 = (known after apply)
      + resource_group_name                                   = "azphoto-dev-rg"
    }

  # module.private_dns_zone.azurerm_private_dns_zone.this["redis"] will be created
+ resource "azurerm_private_dns_zone" "this" {
      + id                                                    = (known after apply)
      + max_number_of_record_sets                             = (known after apply)
      + max_number_of_virtual_network_links                   = (known after apply)
      + max_number_of_virtual_network_links_with_registration = (known after apply)
      + name                                                  = "privatelink.redis.cache.windows.net"
      + number_of_record_sets                                 = (known after apply)
      + resource_group_name                                   = "azphoto-dev-rg"
    }

  # module.private_dns_zone.azurerm_private_dns_zone_virtual_network_link.this["blob"] will be created
+ resource "azurerm_private_dns_zone_virtual_network_link" "this" {
      + id                    = (known after apply)
      + name                  = "vnetlink"
      + private_dns_zone_name = "privatelink.blob.core.windows.net"
      + registration_enabled  = false
      + resource_group_name   = "azphoto-dev-rg"
      + virtual_network_id    = "/subscriptions/14eac771-6a7b-423a-b6ca-d35eca40ba36/resourceGroups/azphoto-dev-rg/providers/Microsoft.Network/virtualNetworks/azphoto-dev-spoke1-vnet"
    }

  # module.private_dns_zone.azurerm_private_dns_zone_virtual_network_link.this["key_vault"] will be created
+ resource "azurerm_private_dns_zone_virtual_network_link" "this" {
      + id                    = (known after apply)
      + name                  = "vnetlink"
      + private_dns_zone_name = "privatelink.vaultcore.azure.net"
      + registration_enabled  = false
      + resource_group_name   = "azphoto-dev-rg"
      + virtual_network_id    = "/subscriptions/14eac771-6a7b-423a-b6ca-d35eca40ba36/resourceGroups/azphoto-dev-rg/providers/Microsoft.Network/virtualNetworks/azphoto-dev-spoke1-vnet"
    }

  # module.private_dns_zone.azurerm_private_dns_zone_virtual_network_link.this["redis"] will be created
+ resource "azurerm_private_dns_zone_virtual_network_link" "this" {
      + id                    = (known after apply)
      + name                  = "vnetlink"
      + private_dns_zone_name = "privatelink.redis.cache.windows.net"
      + registration_enabled  = false
      + resource_group_name   = "azphoto-dev-rg"
      + virtual_network_id    = "/subscriptions/14eac771-6a7b-423a-b6ca-d35eca40ba36/resourceGroups/azphoto-dev-rg/providers/Microsoft.Network/virtualNetworks/azphoto-dev-spoke1-vnet"
    }

  # module.private_endpoint.azurerm_private_endpoint.this["blob"] will be created
+ resource "azurerm_private_endpoint" "this" {
      + custom_dns_configs            = (known after apply)
      + custom_network_interface_name = "azphotodevapp74889-pe-nic"
      + id                            = (known after apply)
      + location                      = "japaneast"
      + name                          = "azphotodevapp74889-pe"
      + network_interface             = (known after apply)
      + private_dns_zone_configs      = (known after apply)
      + resource_group_name           = "azphoto-dev-rg"
      + subnet_id                     = "/subscriptions/14eac771-6a7b-423a-b6ca-d35eca40ba36/resourceGroups/azphoto-dev-rg/providers/Microsoft.Network/virtualNetworks/azphoto-dev-spoke1-vnet/subnets/pe-subnet"

      + private_dns_zone_group {
          + id                   = (known after apply)
          + name                 = "default"
          + private_dns_zone_ids = (known after apply)
        }

      + private_service_connection {
          + is_manual_connection           = false
          + name                           = "connection"
          + private_connection_resource_id = (known after apply)
          + private_ip_address             = (known after apply)
          + subresource_names              = [
              + "blob",
            ]
        }
    }

  # module.private_endpoint.azurerm_private_endpoint.this["key_vault"] will be created
+ resource "azurerm_private_endpoint" "this" {
      + custom_dns_configs            = (known after apply)
      + custom_network_interface_name = "azphoto-dev-app-vault-pe-nic"
      + id                            = (known after apply)
      + location                      = "japaneast"
      + name                          = "azphoto-dev-app-vault-pe"
      + network_interface             = (known after apply)
      + private_dns_zone_configs      = (known after apply)
      + resource_group_name           = "azphoto-dev-rg"
      + subnet_id                     = "/subscriptions/14eac771-6a7b-423a-b6ca-d35eca40ba36/resourceGroups/azphoto-dev-rg/providers/Microsoft.Network/virtualNetworks/azphoto-dev-spoke1-vnet/subnets/pe-subnet"

      + private_dns_zone_group {
          + id                   = (known after apply)
          + name                 = "default"
          + private_dns_zone_ids = (known after apply)
        }

      + private_service_connection {
          + is_manual_connection           = false
          + name                           = "connection"
          + private_connection_resource_id = (known after apply)
          + private_ip_address             = (known after apply)
          + subresource_names              = [
              + "vault",
            ]
        }
    }

  # module.private_endpoint.azurerm_private_endpoint.this["redis"] will be created
+ resource "azurerm_private_endpoint" "this" {
      + custom_dns_configs            = (known after apply)
      + custom_network_interface_name = "azphoto-dev-redis-74889-pe-nic"
      + id                            = (known after apply)
      + location                      = "japaneast"
      + name                          = "azphoto-dev-redis-74889-pe"
      + network_interface             = (known after apply)
      + private_dns_zone_configs      = (known after apply)
      + resource_group_name           = "azphoto-dev-rg"
      + subnet_id                     = "/subscriptions/14eac771-6a7b-423a-b6ca-d35eca40ba36/resourceGroups/azphoto-dev-rg/providers/Microsoft.Network/virtualNetworks/azphoto-dev-spoke1-vnet/subnets/pe-subnet"

      + private_dns_zone_group {
          + id                   = (known after apply)
          + name                 = "default"
          + private_dns_zone_ids = (known after apply)
        }

      + private_service_connection {
          + is_manual_connection           = false
          + name                           = "connection"
          + private_connection_resource_id = (known after apply)
          + private_ip_address             = (known after apply)
          + subresource_names              = [
              + "redisCache",
            ]
        }
    }

  # module.redis.azurerm_redis_cache.this["app"] will be created
+ resource "azurerm_redis_cache" "this" {
      + capacity                      = 0
      + enable_non_ssl_port           = false
      + family                        = "C"
      + hostname                      = (known after apply)
      + id                            = (known after apply)
      + location                      = "japaneast"
      + minimum_tls_version           = "1.2"
      + name                          = "azphoto-dev-redis-74889"
      + port                          = (known after apply)
      + primary_access_key            = (sensitive value)
      + primary_connection_string     = (sensitive value)
      + private_static_ip_address     = (known after apply)
      + public_network_access_enabled = false
      + redis_version                 = "6"
      + replicas_per_master           = (known after apply)
      + replicas_per_primary          = (known after apply)
      + resource_group_name           = "azphoto-dev-rg"
      + secondary_access_key          = (sensitive value)
      + secondary_connection_string   = (sensitive value)
      + sku_name                      = "Basic"
      + ssl_port                      = (known after apply)
    }

  # module.storage.azurerm_storage_account.this["app"] will be created
+ resource "azurerm_storage_account" "this" {
      + access_tier                       = "Hot"
      + account_kind                      = "StorageV2"
      + account_replication_type          = "LRS"
      + account_tier                      = "Standard"
      + allow_nested_items_to_be_public   = true
      + cross_tenant_replication_enabled  = true
      + default_to_oauth_authentication   = false
      + enable_https_traffic_only         = true
      + id                                = (known after apply)
      + infrastructure_encryption_enabled = false
      + is_hns_enabled                    = false
      + large_file_share_enabled          = (known after apply)
      + location                          = "japaneast"
      + min_tls_version                   = "TLS1_2"
      + name                              = "azphotodevapp74889"
      + nfsv3_enabled                     = false
      + primary_access_key                = (sensitive value)
      + primary_blob_connection_string    = (sensitive value)
      + primary_blob_endpoint             = (known after apply)
      + primary_blob_host                 = (known after apply)
      + primary_connection_string         = (sensitive value)
      + primary_dfs_endpoint              = (known after apply)
      + primary_dfs_host                  = (known after apply)
      + primary_file_endpoint             = (known after apply)
      + primary_file_host                 = (known after apply)
      + primary_location                  = (known after apply)
      + primary_queue_endpoint            = (known after apply)
      + primary_queue_host                = (known after apply)
      + primary_table_endpoint            = (known after apply)
      + primary_table_host                = (known after apply)
      + primary_web_endpoint              = (known after apply)
      + primary_web_host                  = (known after apply)
      + public_network_access_enabled     = true
      + queue_encryption_key_type         = "Service"
      + resource_group_name               = "azphoto-dev-rg"
      + secondary_access_key              = (sensitive value)
      + secondary_blob_connection_string  = (sensitive value)
      + secondary_blob_endpoint           = (known after apply)
      + secondary_blob_host               = (known after apply)
      + secondary_connection_string       = (sensitive value)
      + secondary_dfs_endpoint            = (known after apply)
      + secondary_dfs_host                = (known after apply)
      + secondary_file_endpoint           = (known after apply)
      + secondary_file_host               = (known after apply)
      + secondary_location                = (known after apply)
      + secondary_queue_endpoint          = (known after apply)
      + secondary_queue_host              = (known after apply)
      + secondary_table_endpoint          = (known after apply)
      + secondary_table_host              = (known after apply)
      + secondary_web_endpoint            = (known after apply)
      + secondary_web_host                = (known after apply)
      + sftp_enabled                      = false
      + shared_access_key_enabled         = true
      + table_encryption_key_type         = "Service"

      + blob_properties {
          + change_feed_enabled      = false
          + default_service_version  = (known after apply)
          + last_access_time_enabled = false
          + versioning_enabled       = false

          + container_delete_retention_policy {
              + days = 7
            }

          + delete_retention_policy {
              + days = 7
            }
        }

      + network_rules {
          + bypass                     = [
              + "AzureServices",
            ]
          + default_action             = "Allow"
          + ip_rules                   = (known after apply)
          + virtual_network_subnet_ids = (known after apply)
        }
    }

  # module.storage.azurerm_storage_account.this["log"] will be created
+ resource "azurerm_storage_account" "this" {
      + access_tier                       = "Hot"
      + account_kind                      = "StorageV2"
      + account_replication_type          = "LRS"
      + account_tier                      = "Standard"
      + allow_nested_items_to_be_public   = true
      + cross_tenant_replication_enabled  = true
      + default_to_oauth_authentication   = false
      + enable_https_traffic_only         = true
      + id                                = (known after apply)
      + infrastructure_encryption_enabled = false
      + is_hns_enabled                    = false
      + large_file_share_enabled          = (known after apply)
      + location                          = "japaneast"
      + min_tls_version                   = "TLS1_2"
      + name                              = "azphotodevlog74889"
      + nfsv3_enabled                     = false
      + primary_access_key                = (sensitive value)
      + primary_blob_connection_string    = (sensitive value)
      + primary_blob_endpoint             = (known after apply)
      + primary_blob_host                 = (known after apply)
      + primary_connection_string         = (sensitive value)
      + primary_dfs_endpoint              = (known after apply)
      + primary_dfs_host                  = (known after apply)
      + primary_file_endpoint             = (known after apply)
      + primary_file_host                 = (known after apply)
      + primary_location                  = (known after apply)
      + primary_queue_endpoint            = (known after apply)
      + primary_queue_host                = (known after apply)
      + primary_table_endpoint            = (known after apply)
      + primary_table_host                = (known after apply)
      + primary_web_endpoint              = (known after apply)
      + primary_web_host                  = (known after apply)
      + public_network_access_enabled     = true
      + queue_encryption_key_type         = "Service"
      + resource_group_name               = "azphoto-dev-rg"
      + secondary_access_key              = (sensitive value)
      + secondary_blob_connection_string  = (sensitive value)
      + secondary_blob_endpoint           = (known after apply)
      + secondary_blob_host               = (known after apply)
      + secondary_connection_string       = (sensitive value)
      + secondary_dfs_endpoint            = (known after apply)
      + secondary_dfs_host                = (known after apply)
      + secondary_file_endpoint           = (known after apply)
      + secondary_file_host               = (known after apply)
      + secondary_location                = (known after apply)
      + secondary_queue_endpoint          = (known after apply)
      + secondary_queue_host              = (known after apply)
      + secondary_table_endpoint          = (known after apply)
      + secondary_table_host              = (known after apply)
      + secondary_web_endpoint            = (known after apply)
      + secondary_web_host                = (known after apply)
      + sftp_enabled                      = false
      + shared_access_key_enabled         = true
      + table_encryption_key_type         = "Service"

      + blob_properties {
          + change_feed_enabled      = false
          + default_service_version  = (known after apply)
          + last_access_time_enabled = false
          + versioning_enabled       = false

          + container_delete_retention_policy {
              + days = 7
            }

          + delete_retention_policy {
              + days = 7
            }
        }

      + network_rules {
          + bypass                     = [
              + "AzureServices",
            ]
          + default_action             = "Deny"
          + ip_rules                   = [
              + "113.39.66.10",
              + "217.178.97.227",
              + "52.140.232.52",
            ]
          + virtual_network_subnet_ids = (known after apply)
        }
    }

  # module.storage.azurerm_storage_container.this["app_media"] will be created
+ resource "azurerm_storage_container" "this" {
      + container_access_type   = "blob"
      + has_immutability_policy = (known after apply)
      + has_legal_hold          = (known after apply)
      + id                      = (known after apply)
      + metadata                = (known after apply)
      + name                    = "media"
      + resource_manager_id     = (known after apply)
      + storage_account_name    = "azphotodevapp74889"
    }

  # module.storage.azurerm_storage_container.this["app_static"] will be created
+ resource "azurerm_storage_container" "this" {
      + container_access_type   = "blob"
      + has_immutability_policy = (known after apply)
      + has_legal_hold          = (known after apply)
      + id                      = (known after apply)
      + metadata                = (known after apply)
      + name                    = "static"
      + resource_manager_id     = (known after apply)
      + storage_account_name    = "azphotodevapp74889"
    }

  # module.storage.azurerm_storage_container.this["log"] will be created
+ resource "azurerm_storage_container" "this" {
      + container_access_type   = "private"
      + has_immutability_policy = (known after apply)
      + has_legal_hold          = (known after apply)
      + id                      = (known after apply)
      + metadata                = (know
```
</details>
<br>

**Warning**: Output length greater than max comment size. Continued in next comment.